Revit 2024 API
SpatialElementTag.LeaderEnd Property
 The position of the leader's end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ LeaderEnd { get; set; }
Visual Basic
Public Property LeaderEnd As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Returns the end point of the tag leader. Leader end point must be located inside of a room, space or an area. Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The point is located outside of the spatial element.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no leader for this tag. -or- When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned.
See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace